mdhardenburgh/Blinky/Packages/.cache/Atmel.SAME51_DFP.1.1.129.pdsc
      <condition id="ATSAME51N20A">
         <require Dvendor="Atmel:3" Dname="ATSAME51N20A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51J18A">
         <require Dvendor="Atmel:3" Dname="ATSAME51J18A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="ATSAME51J19A">
         <require Dvendor="Atmel:3" Dname="ATSAME51J19A"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME51N19A">
         <description>Headers and startup code for Atmel ATSAME51N19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51n19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51n19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same51.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same51.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51n19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51n19a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME51J20A">
         <description>Headers and startup code for Atmel ATSAME51J20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j20a_sram.ld" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME51N20A">
         <description>Headers and startup code for Atmel ATSAME51N20A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51n20a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51n20a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same51.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same51.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51n20a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51n20a_sram.icf" attr="config"/>
         </files>
      </component>
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME51J18A">
         <description>Headers and startup code for Atmel ATSAME51J18A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j18a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j18a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same51.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same51.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j18a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j18a_sram.icf" attr="config"/>
         </files>
      </component>
