mdhardenburgh/Blinky/Packages/.cache/Atmel.SAME51_DFP.1.1.129.pdsc
      <component Cvendor="Atmel" Cclass="Device" Cgroup="Startup" Cversion="1.1.0" condition="ATSAME51J19A">
         <description>Headers and startup code for Atmel ATSAME51J19A</description>
         <files>
            <file condition="C" category="include" name="include"/>
            <file condition="C" category="header" name="include/sam.h"/>
            <file condition="C Exe" category="source" name="templates/main.c" attr="template" select="Main file (.c)"/>
            <file condition="C Exe" category="source" name="templates/main.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="C Lib" category="source" name="templates/library.c" attr="template" select="Main file (.c)"/>
            <file condition="C Lib" category="source" name="templates/library.cpp" attr="template" select="Main file (.cpp)"/>
            <file condition="GCC Exe" category="source" name="gcc/system_same51.c" attr="config"/>
            <file condition="GCC Exe" category="source" name="gcc/gcc/startup_same51.c" attr="config"/>
            <file condition="GCC Exe" category="linkerScript" name="gcc/gcc/same51j19a_flash.ld" attr="config"/>
            <file condition="GCC Exe" category="other" name="gcc/gcc/same51j19a_sram.ld" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/system_same51.c" attr="config"/>
            <file condition="ARMCC Exe" category="source" name="armcc/arm_addon/armcc/arm/startup_same51.s" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/system_same51.c" attr="config"/>
            <file condition="IAR Exe" category="source" name="iar/iar/startup_same51.c" attr="config"/>
            <file condition="IAR Exe" category="linkerScript" name="iar/iar/same51j19a_flash.icf" attr="config"/>
            <file condition="IAR Exe" category="other" name="iar/iar/same51j19a_sram.icf" attr="config"/>
         </files>
      </component>
   </components>
</package>
